old/internships.2022.optim-VBQC/index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Protocol optimizations for secure delegated/multi-party quantum computation | Harold Ollivier</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../rss.xml">
<link rel="canonical" href="https://h-oll.github.io/internships.2022.optim-VBQC/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Harold Ollivier">
<meta property="og:title" content="Protocol optimizations for secure delegated/multi-party quantum comput">
<meta property="og:url" content="https://h-oll.github.io/internships.2022.optim-VBQC/">
<meta property="og:description" content="Summary


Various protocols have been described in the previous years for achieving secure (verifiable and blind) quantum computation, but most remain theoretical tools due to their high overheads. Th">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-09-25T13:01:09+02:00">
</head>
<body>

	<a href="#page-content" class="sr-only sr-only-focusable">
		Skip to main content
	</a>

	

    <section id="header"><a href="../">
			<div class="logo">
					<div id="nologoimage">
						Harold Ollivier
					</div>
    		</div>
			</a>
    </section><section id="socialNav"><!-- Navigation Menu - on top on small screens, down the left on larger --><div class="navlinks">
			<a href="../">
				<div id="titleauth">
				    Home<!--Harold Ollivier<br /> by Harold Ollivier-->
				</div>
			</a>

            <!-- Navigation links (hidden by default) -->
			<div id="navmenuitems">
				            <a href="../projects" title="Projects">
                <span class="menuitemtext">Projects</span>
                <span class="menuitemicon"><i class="fa fa-industry"></i></span>
            </a>
            <a href="../hiring" title="Open Positions">
                <span class="menuitemtext">Open Positions</span>
                <span class="menuitemicon"><i class="fa fa-folder-open"></i></span>
            </a>
            <a href="../about" title="About me">
                <span class="menuitemtext">About me</span>
                <span class="menuitemicon"><i class="fa fa-user"></i></span>
            </a>
            <a href="https://twitter.com/h_oll" title="Twitter">
                <span class="menuitemtext">Twitter</span>
                <span class="menuitemicon"><i class="fab fa-twitter"></i></span>
            </a>
            <a href="https://github.com/h-oll" title="Github">
                <span class="menuitemtext">Github</span>
                <span class="menuitemicon"><i class="fab fa-github"></i></span>
            </a>
            <a href="mailto://harold.ollivier@inria.fr" title="Email">
                <span class="menuitemtext">Email</span>
                <span class="menuitemicon"><i class="fa fa-envelope"></i></span>
            </a>
    
    

			</div>

            <!-- "Hamburger menu" / "Bar icon" to toggle the navigation links -->
			<a href="javascript:void(0);" id="hamburger" class="icon" onclick="toggleNav()">
				<i class="fa fa-bars">
				</i>
			</a>
		</div>

	</section><section class="page-content"><div class="content" rel="main">
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header></header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgc1e6f6a" class="outline-2">
<h2 id="orgc1e6f6a">Summary</h2>
<div class="outline-text-2" id="text-orgc1e6f6a">
<p>
Various protocols have been described in the previous years for achieving secure (verifiable and blind) quantum computation, but most remain theoretical tools due to their high overheads. The intern will work on optimizing some of them with the aim of implementing them on real machines.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Topic</b></td>
<td class="org-left"> </td>
<td class="org-left">Multi-Party Computing, Cryptography</td>
</tr>
<tr>
<td class="org-left"><b>Location</b></td>
<td class="org-left"> </td>
<td class="org-left">INRIA Paris (Cosmiq Team)</td>
</tr>
<tr>
<td class="org-left"><b>Head of Team</b></td>
<td class="org-left"> </td>
<td class="org-left">Jean-Pierre Tillich</td>
</tr>
<tr>
<td class="org-left"><b>Advisor</b></td>
<td class="org-left"> </td>
<td class="org-left">Harold Ollivier</td>
</tr>
<tr>
<td class="org-left"><b>Requirements</b></td>
<td class="org-left"> </td>
<td class="org-left">Basic notions of quantum computing, cryptography</td>
</tr>
<tr>
<td class="org-left"><b>Starting</b></td>
<td class="org-left"> </td>
<td class="org-left">Spring 2022</td>
</tr>
<tr>
<td class="org-left"><b>Duration</b></td>
<td class="org-left"> </td>
<td class="org-left">4-6 months</td>
</tr>
<tr>
<td class="org-left"><b>Contact</b></td>
<td class="org-left"> </td>
<td class="org-left">harold.ollivier [at] inria.fr</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org435dc9c" class="outline-2">
<h2 id="org435dc9c">Context</h2>
<div class="outline-text-2" id="text-org435dc9c">
<p>
Remotely accessible quantum computing platforms free clients from the burden of maintaining complex physical devices in house. Yet, when delegating computations, they want their data and algorithms to remain private, and that these computations are executed as specified. Several methods have been devised to achieve this (see refs. below)
</p>

<p>
Yet, until only one protocol has the potential of being applicable in practice. This is because, it's overhead has been reduced to repetitions only and it exhibits noise robustness so that it does not continuously abort the computations like previous protocols that tend to mistake genuine errors for a malicious behavior.
</p>

<p>
Following this first example, other protocols need to be optimized for real world quantum computers.
</p>
</div>
</div>

<div id="outline-container-org6b20df4" class="outline-2">
<h2 id="org6b20df4">Objective</h2>
<div class="outline-text-2" id="text-org6b20df4">
<p>
The objective of this project is to propose optimized protocols that are able to withstand noise and have low resource overheads, potentially leading to implementation proposals for real quantum hardware.
</p>

<p>
Two target protocols will be looked at:
</p>
<ul class="org-ul">
<li>A delegated nulti-party protocol that uses the measurement based model of computation for ensuring privacy</li>
<li>A circuit based protocol for client - server delegation</li>
</ul>
<p>
The possible techniques include those developed in arXiv:2109.04042, and a direct optimization of some computation patterns found in arXiv:2102.12949. A change in the security model is also a possible option gaining practicality but losing statistical security for hardware security.
</p>

<p>
The various steps to progress toward this goal:
</p>
<ul class="org-ul">
<li>Gain a good understanding of both target protocols</li>
<li>Extract sub-optimal routines</li>
<li>Review the techniques yielding noise robustness and detection sensitivity amplification</li>
<li>Understand how the switch to the quantum enclave model could help achieve the similar goals</li>
<li>Apply the various techniques to sub-optimal routines</li>
</ul>
</div>
</div>

<div id="outline-container-org1169281" class="outline-2">
<h2 id="org1169281">References</h2>
<div class="outline-text-2" id="text-org1169281">
<ul class="org-ul">
<li>Protocols for verified computation
<ul class="org-ul">
<li>Universal blind quantum computation, Broadbent A and Fitzsimons J and Kashefi E, arXiv:0807.4154</li>
<li>Unconditionally verifiable blind computation, Fitzsimons J F and Kashefi E, arXiv:1203.5217</li>
<li>Verification of quantum computation: An overview of existing approaches, Gheorghiu A and Kapourniotis T and Kashefi E, arXiv:1709.06984</li>
</ul>
</li>
<li>Robust verification protocols
<ul class="org-ul">
<li>Verifying BQP Computations on Noisy Devices with Minimal Overhead, Leichtle D and Music L and Kashefi E and Ollivier, arXiv:2109.04042</li>
</ul>
</li>
<li>Hardware security for quantum computing
<ul class="org-ul">
<li>QEnclave – A practical solution for secure quantum cloud computing, Ma Y and Kashefi E and Arapinis M and Chakraborty K and Kaplan M, arXiv:2109.02952</li>
</ul>
</li>
<li>Possible target protocols for optimisation
<ul class="org-ul">
<li>Delegating Multi-Party Quantum Computations vs. Dishonest Majority in Two Quantum Rounds, Kapourniotis T and Kashefi E and Music L and Ollivier H, arXiv:2102.12949</li>
<li>How to Verify a Quantum Computation, Broadbent A, arXiv:1509.09180</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    
</article><footer id="footer"><p>Contents © 2022         <a href="mailto:harold.ollivier@inria.fr">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
	</section><script src="../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>

    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");

	</script><!-- end fancy dates --><script>

    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});

	</script><script src="../assets/js/ToggleNav.js">
	</script><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=G-RGE92PZF3Q"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-RGE92PZF3Q');
</script>
</body>
</html>
